Catalogs/НастройкиУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиУчетаЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсобыеПравилаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокСтатейЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПрямыхЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиУчетаЗатрат/Forms/ПравилоЗакрытияСчетовЗатрат/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Правило = Новый Структура;
	
	Правило.Вставить("Период");
	Правило.Вставить("Организация");
	
	Поля = Метаданные.Справочники.НастройкиУчетаЗатрат.ТабличныеЧасти.ОсобыеПравилаРаспределения.Реквизиты;
	Для Каждого ОписаниеПоля Из Поля Цикл
		Правило.Вставить(ОписаниеПоля.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Правило, Параметры);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Правило);
	
	НастроитьОграниченияСчетовУчета();
	ПрименитьФункциональныеОпции();
	
	НастроитьМодификаторы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если БазаРаспределения <> Перечисления.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "СписокСтатейЗатрат");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура БазаРаспределенияПриИзменении(Элемент)
	
	НастроитьМодификаторы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БазаРаспределенияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если БазаРаспределения <> ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат") Тогда
		СписокСтатейЗатрат = Неопределено;
	ИначеЕсли БазаРаспределения <> ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.Выручка") Тогда
		СчетПрямыхЗатрат    = Неопределено;
		ПодразделениеЗатрат = Неопределено;
	КонецЕсли;
	
	Правило = НастройкиУчетаКлиент.ПоляПравилаРаспределения();
	ЗаполнитьЗначенияСвойств(Правило, ЭтотОбъект);
	
	Закрыть(Правило);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьОграниченияСчетовУчета()
	
	БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(
		Элементы.Счет,
		Справочники.НастройкиУчетаЗатрат.НастраиваемыеСчетаОсобыеПравилаРаспределения(),
		Неопределено,
		Неопределено,
		Неопределено);
	
	УчетПроизводства.ОграничитьВыборСчетамиПрямыхРасходов(Элементы.СчетПрямыхЗатрат);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьФункциональныеОпции()
	
	ЗначениеОпции = ПолучитьФункциональнуюОпцию("ВестиУчетЗатратПоПодразделениям");
	Элементы.Подразделение.Видимость       = ЗначениеОпции;
	Элементы.ПодразделениеЗатрат.Видимость = ЗначениеОпции;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьМодификаторы(Форма)
	
	ПоляМодификаторов = Новый Соответствие;
	
	ПоляМодификаторов.Вставить(
		ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.Выручка"),
		Форма.Элементы.МодификаторыВыручка);
	ПоляМодификаторов.Вставить(
		ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат"),
		Форма.Элементы.МодификаторыСписокПрямыхЗатрат);
	
	Для Каждого ОписаниеПоля Из ПоляМодификаторов Цикл
		ОписаниеПоля.Значение.Видимость = (Форма.БазаРаспределения = ОписаниеПоля.Ключ);
	КонецЦикла;
	
	Форма.КлючСохраненияПоложенияОкна = Форма.БазаРаспределения; // чтобы восстанавливался размер формы, соответствующий контенту
	
КонецПроцедуры

#КонецОбласти
